### Pandas Example Code

In [1]:
import pandas as pd
kl_temp = pd.Series(index=['Mon','Tue','Wed'], data =[36, 34, 37])
pg_temp = pd.Series(index=['Sun','Mon','Tue'], data =[31, 33, 32])

In [2]:
kl_temp

Mon    36
Tue    34
Wed    37
dtype: int64

In [3]:
pg_temp

Sun    31
Mon    33
Tue    32
dtype: int64

In [2]:
kl_temp - pg_temp

Mon    3.0
Sun    NaN
Tue    2.0
Wed    NaN
dtype: float64

In [4]:
kl_temp + 1

Mon    37
Tue    35
Wed    38
dtype: int64

In [5]:
kl_temp.min()

34

In [6]:
kl_temp.idxmin()

'Tue'

In [7]:
(kl_temp-pg_temp).max()

3.0

In [8]:
kl_temp > 35

Mon     True
Tue    False
Wed     True
dtype: bool

In [10]:
# Using Bolean mask to filter the series
kl_temp[kl_temp > 35]

Mon    36
Wed    37
dtype: int64

In [11]:
city_data = pd.DataFrame({'kl':kl_temp,
                          'penang':pg_temp})

In [12]:
city_data

       kl  penang
Mon  36.0    33.0
Sun   NaN    31.0
Tue  34.0    32.0
Wed  37.0     NaN

In [13]:
ufo = pd.read_csv('datasets/ufo.csv')

In [14]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [18]:
ufo.isnull().sum()

City                  47
Colors Reported    63509
Shape Reported      8402
State                  0
Time                   0
dtype: int64